export const mockAptTradeResponse = {
  response: {
    header: {
      resultCode: "00",
      resultMsg: "NORMAL SERVICE"
    },
    body: {
      items: {
        item: [
          {
            거래금액: "123,000",
            건축년도: "2010",
            년: "2024",
            월: "3",
            일: "15",
            전용면적: "84.95",
            층: "15",
            법정동: "상계동",
            지번: "746",
            아파트: "상계주공7단지",
            거래유형: "직거래",
            동: "702"
          },
          {
            거래금액: "145,000",
            건축년도: "2015",
            년: "2024",
            월: "3",
            일: "10",
            전용면적: "109.23",
            층: "23",
            법정동: "상계동",
            지번: "756",
            아파트: "롯데캐슬시그니처",
            거래유형: "중개거래",
            동: "103"
          },
          {
            거래금액: "89,000",
            건축년도: "1999",
            년: "2024",
            월: "3",
            일: "5",
            전용면적: "59.97",
            층: "8",
            법정동: "상계동",
            지번: "626",
            아파트: "상계벽산",
            거래유형: "직거래"
          },
          {
            거래금액: "98,500",
            건축년도: "2005",
            년: "2024",
            월: "3",
            일: "20",
            전용면적: "68.88",
            층: "12",
            법정동: "상계동",
            지번: "366",
            아파트: "상계대림",
            거래유형: "중개거래",
            동: "205"
          },
          {
            거래금액: "135,000",
            건축년도: "2018",
            년: "2024",
            월: "3",
            일: "25",
            전용면적: "84.95",
            층: "18",
            법정동: "상계동",
            지번: "856",
            아파트: "상계센트럴푸르지오",
            거래유형: "중개거래",
            동: "305"
          }
        ]
      },
      totalCount: "5",
      numOfRows: "100",
      pageNo: "1"
    }
  }
}; 